Repository: RUGyron/I-Wish-App
Catalog: IWish/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans

source: If you lose all your Apple ID devices and reset iCloud Keychain — the data becomes unreadable forever. That’s the price for the developer never being able to peek inside.
de: Wenn Sie alle Apple-ID-Geräte verlieren und den iCloud-Schlüsselbund zurücksetzen, sind die Daten für immer unlesbar. Das ist der Preis dafür, dass der Entwickler nie hineinschauen kann.
es: Si pierdes todos los dispositivos asociados a tu Apple ID y restableces el Llavero de iCloud, los datos serán ilegibles para siempre. Es el precio de que el desarrollador no pueda ver nada dentro.
fr: Si tu perds tous tes appareils Apple ID et que tu réinitialises ton trousseau iCloud, les données deviennent illisibles à jamais. C’est le prix à payer pour que le développeur ne puisse jamais y jeter un œil.
it: Se perdi tutti i dispositivi associati al tuo ID Apple e azzeri il portachiavi iCloud, i dati diventano illeggibili per sempre. È il prezzo del fatto che lo sviluppatore non possa mai sbirciarvi dentro.
ja: Apple IDのデバイスをすべて失い、iCloudキーチェーンをリセットすると、データは永久に読めなくなります。開発者が中身を覗けないことの代償です。
ko: Apple ID 기기를 모두 잃고 iCloud 키체인을 초기화하면 데이터를 영원히 읽을 수 없게 돼요. 개발자가 절대 들여다볼 수 없게 만든 대가예요.
pt_br: Se você perder todos os dispositivos do seu Apple ID e redefinir as Chaves do iCloud, os dados ficarão ilegíveis para sempre. É o preço por o desenvolvedor nunca poder olhar dentro.
ru: Если вы потеряете все Apple ID устройства и сбросите iCloud Keychain — данные станут нечитаемыми навсегда. Это плата за то, что разработчик никогда не может в них заглянуть.
zh_hans: 如果你丢失了所有 Apple ID 设备并重置了 iCloud 钥匙串,数据将永远无法读取。这是开发者无法窥探内容的代价。

source: Keys live in iCloud Keychain
de: Schlüssel liegen im iCloud-Schlüsselbund
es: Las claves viven en el Llavero de iCloud
fr: Les clés vivent dans le trousseau iCloud
it: Le chiavi vivono nel portachiavi iCloud
ja: 鍵はiCloudキーチェーンに保管
ko: 키는 iCloud 키체인에 보관돼요
pt_br: As chaves vivem nas Chaves do iCloud
ru: Ключи живут в iCloud Keychain
zh_hans: 密钥保存在 iCloud 钥匙串中

source: An encryption key for each list is generated locally and saved to iCloud Keychain. Apple syncs it between your Apple ID devices through an end-to-end secure channel. Apple sees keys only in encrypted form, the developer — never.
de: Für jede Liste wird ein Schlüssel lokal erzeugt und im iCloud-Schlüsselbund gesichert. Apple synchronisiert ihn zwischen Ihren Apple-ID-Geräten über einen Ende-zu-Ende verschlüsselten Kanal. Apple sieht Schlüssel nur verschlüsselt, der Entwickler — nie.
es: Cada lista tiene una clave de cifrado que se genera localmente y se guarda en el Llavero de iCloud. Apple la sincroniza entre tus dispositivos de Apple ID por un canal seguro de extremo a extremo. Apple solo ve las claves cifradas; el desarrollador, nunca.
fr: Une clé de chiffrement est générée localement pour chaque liste et enregistrée dans le trousseau iCloud. Apple la synchronise entre tes appareils Apple ID via un canal sécurisé de bout en bout. Apple ne voit les clés que chiffrées, le développeur — jamais.
it: La chiave di cifratura di ogni lista è generata localmente e salvata nel portachiavi iCloud. Apple la sincronizza tra i tuoi dispositivi ID Apple tramite un canale sicuro end-to-end. Apple vede le chiavi solo cifrate, lo sviluppatore — mai.
ja: リストごとの暗号鍵はデバイス上で生成され、iCloudキーチェーンに保存されます。AppleはApple IDのデバイス間でエンドツーエンドの安全な経路を使って同期します。Appleが見るのは暗号化された鍵だけ、開発者は一切見ません。
ko: 리스트별 암호화 키는 기기에서 생성되어 iCloud 키체인에 저장돼요. Apple은 종단 간 보안 채널로 Apple ID 기기들 사이에서 동기화해요. Apple은 키를 암호화된 형태로만 보고, 개발자는 절대 볼 수 없어요.
pt_br: A chave de criptografia de cada lista é gerada localmente e salva nas Chaves do iCloud. A Apple sincroniza entre seus dispositivos Apple ID por um canal seguro de ponta a ponta. A Apple só vê as chaves criptografadas; o desenvolvedor, nunca.
ru: Ключ шифрования каждого списка генерируется локально и сохраняется в iCloud Keychain. Apple синхронизирует его между вашими Apple ID устройствами через end-to-end защищённый канал. Apple ключи видит только в зашифрованном виде, разработчик — никогда.
zh_hans: 每个列表的加密密钥都在本地生成并保存到 iCloud 钥匙串中。Apple 通过端到端的安全通道在你的 Apple ID 设备间同步。Apple 只能看到加密形式的密钥,开发者永远看不到。

source: Data is stored on Google Firebase. Through the Firebase console the developer can see only technical info: list counts, creation times, size of encrypted blobs, and “who shared with whom” links. The content itself — no.
de: Daten werden in Google Firebase gespeichert. Über die Firebase-Konsole sieht der Entwickler nur technische Informationen: Listenanzahl, Erstellungszeit, Größe der verschlüsselten Blobs und Verbindungen „wer hat mit wem geteilt“. Den Inhalt selbst — nein.
es: Los datos se almacenan en Google Firebase. A través de la consola de Firebase, el desarrollador solo puede ver información técnica: cantidad de listas, hora de creación, tamaño de los blobs cifrados y las relaciones de “quién compartió con quién”. El contenido en sí, no.
fr: Les données sont stockées sur Google Firebase. Via la console Firebase, le développeur ne voit que des informations techniques : nombre de listes, dates de création, taille des blobs chiffrés et les liens « qui a partagé avec qui ». Le contenu lui-même — non.
it: I dati sono archiviati su Google Firebase. Tramite la console Firebase, lo sviluppatore può vedere solo informazioni tecniche: numero di liste, orari di creazione, dimensione dei blob cifrati e i collegamenti “chi ha condiviso con chi”. I contenuti — no.
ja: データはGoogle Firebaseに保存されます。Firebaseのコンソールから開発者が見られるのは技術情報のみです: リスト数、作成時刻、暗号化されたブロブのサイズ、「誰が誰と共有したか」の関係。中身は見えません。
ko: 데이터는 Google Firebase에 저장돼요. Firebase 콘솔에서 개발자가 볼 수 있는 건 기술 정보뿐이에요: 리스트 수, 생성 시각, 암호화된 블롭의 크기, 그리고 ‘누가 누구와 공유했는가’의 관계. 콘텐츠 자체는 보이지 않아요.
pt_br: Os dados são guardados no Google Firebase. Pelo console do Firebase, o desenvolvedor só consegue ver informações técnicas: quantidade de listas, horários de criação, tamanho dos blobs criptografados e as conexões “quem compartilhou com quem”. O conteúdo em si — não.
ru: Данные хранятся в Google Firebase. Разработчик через консоль Firebase может узнать только техническую информацию: количество списков, время создания, размер зашифрованных блобов и связи «кто с кем поделился». Содержимое — нет.
zh_hans: 数据存储在 Google Firebase。开发者通过 Firebase 控制台只能看到技术信息:列表数量、创建时间、加密 blob 的大小,以及「谁与谁分享」的关系。内容本身则无法查看。

source: When you share a list, the encryption key is embedded in the QR code or link (after `#`) and is not sent to the server. The recipient scans the QR — the key ends up on their device locally, and their iPhone decrypts the content itself.
de: Beim Teilen einer Liste wird der Schlüssel in den QR-Code oder Link (nach `#`) eingebettet und nicht an den Server gesendet. Der Empfänger scannt den QR — der Schlüssel landet lokal auf seinem Gerät, und sein iPhone entschlüsselt die Inhalte selbst.
es: Cuando compartes una lista, la clave de cifrado se incrusta en el QR o en el enlace (después del `#`) y no se envía al servidor. El destinatario escanea el QR — la clave llega localmente a su dispositivo y su iPhone descifra el contenido por sí mismo.
fr: Lorsque tu partages une liste, la clé de chiffrement est intégrée au QR code ou au lien (après le `#`) et n’est pas envoyée au serveur. Le destinataire scanne le QR — la clé arrive localement sur son appareil et son iPhone déchiffre le contenu.
it: Quando condividi una lista, la chiave di cifratura è incorporata nel QR code o nel link (dopo `#`) e non viene inviata al server. Il destinatario scansiona il QR — la chiave arriva localmente sul suo dispositivo e l’iPhone decifra i contenuti da solo.
ja: リストを共有すると、暗号鍵はQRコードやリンクの`#`以降に埋め込まれ、サーバーには送信されません。受け取った相手がQRをスキャンすると、鍵はそのデバイス内に取り込まれ、相手のiPhoneが自分で中身を復号します。
ko: 리스트를 공유하면 암호화 키는 QR 코드나 링크(`#` 뒤)에 포함되며 서버로 전송되지 않아요. 받는 쪽이 QR을 스캔하면 키는 그 사람 기기에 로컬로 들어가고, 상대의 iPhone이 직접 내용을 복호화해요.
pt_br: Quando você compartilha uma lista, a chave de criptografia fica embutida no QR code ou no link (depois do `#`) e não é enviada ao servidor. O destinatário escaneia o QR — a chave entra no dispositivo dele localmente e o iPhone dele descriptografa o conteúdo.
ru: Когда вы делитесь списком, ключ шифрования встраивается в QR-код или ссылку (после `#`) и не отправляется на сервер. Получатель сканирует QR — ключ оказывается у него локально, и его iPhone сам расшифровывает содержимое.
zh_hans: 当你分享列表时,加密密钥被嵌入到二维码或链接(`#` 之后),并不会发送到服务器。接收者扫描二维码 — 密钥便会进入他们的设备本地,他们的 iPhone 自己解密内容。

source: List names, wishes, photos, prices, descriptions, links — everything is encrypted with AES-256 right on your iPhone before it flies to the cloud. Only unreadable bytes are stored on the server.
de: Listennamen, Wünsche, Fotos, Preise, Beschreibungen, Links — alles wird mit AES-256 direkt auf Ihrem iPhone verschlüsselt, bevor es in die Cloud fliegt. Auf dem Server liegen nur unlesbare Bytes.
es: Los nombres de las listas, los deseos, las fotos, los precios, las descripciones, los enlaces — todo se cifra con AES-256 en tu propio iPhone antes de viajar a la nube. En el servidor solo se almacenan bytes ilegibles.
fr: Noms de listes, vœux, photos, prix, descriptions, liens — tout est chiffré en AES-256 directement sur ton iPhone avant d’atteindre le cloud. Le serveur ne stocke que des octets illisibles.
it: Nomi delle liste, desideri, foto, prezzi, descrizioni, link — tutto è cifrato in AES-256 direttamente sul tuo iPhone prima di volare nel cloud. Sul server restano solo byte illeggibili.
ja: リスト名、願い、写真、価格、説明、リンク — すべてがクラウドへ飛ぶ前にiPhone上でAES-256により暗号化されます。サーバーに残るのは読み取れないバイト列のみです。
ko: 리스트 이름, 위시, 사진, 가격, 설명, 링크 — 모든 것은 클라우드로 가기 전에 iPhone에서 AES-256으로 암호화돼요. 서버에는 읽을 수 없는 바이트만 저장돼요.
pt_br: Nomes de listas, desejos, fotos, preços, descrições, links — tudo é criptografado com AES-256 direto no seu iPhone antes de ir para a nuvem. No servidor ficam só bytes ilegíveis.
ru: Имена списков, желания, фотки, цены, описания, ссылки — всё шифруется AES-256 прямо на вашем iPhone до того, как улетит в облако. На сервере хранятся только нечитаемые байты.
zh_hans: 列表名、心愿、照片、价格、描述、链接 — 一切都会在飞往云端之前,在你的 iPhone 上以 AES-256 加密。服务器上只会留下无法读取的字节。

source: Apple Sign In sends the name only on the first sign-in. To get the name again, you need to reset the link with the app.
de: Apple Sign In übermittelt den Namen nur bei der ersten Anmeldung. Um den Namen erneut zu erhalten, muss die Verknüpfung mit der App zurückgesetzt werden.
es: Apple Sign In envía el nombre solo en el primer inicio de sesión. Para volver a obtenerlo, hay que restablecer el vínculo con la app.
fr: Apple Sign In ne transmet le nom qu’à la première connexion. Pour le récupérer, il faut réinitialiser le lien avec l’app.
it: Apple Sign In invia il nome solo al primo accesso. Per riaverlo, occorre azzerare il collegamento con l’app.
ja: Apple Sign Inは初回サインインの時だけ名前を渡します。再度受け取るには、アプリとの連携をリセットする必要があります。
ko: Apple Sign In은 최초 로그인 때만 이름을 전달해요. 다시 받으려면 앱과의 연결을 재설정해야 해요.
pt_br: O Apple Sign In envia o nome apenas no primeiro login. Para receber o nome de novo, é preciso redefinir o vínculo com o app.
ru: Apple Sign In передаёт имя только при первой авторизации. Чтобы получить имя заново — нужно сбросить связь с приложением.
zh_hans: Apple Sign In 只会在首次登录时传递名字。如需再次获取,需要重置与该 App 的关联。

source: e.g. Birthday
de: z. B. Geburtstag
es: Por ejemplo: Cumpleaños
fr: Par ex. Anniversaire
it: Es. Compleanno
ja: 例: 誕生日
ko: 예: 생일
pt_br: Ex.: Aniversário
ru: Например: На день рождения
zh_hans: 例如:生日

source: editor
de: Bearbeiter
fr: éditeur
ja: 編集者
ko: 편집자
ru: редактор
zh_hans: 编辑者

source: up to %@
de: bis %@
es: hasta %@
fr: jusqu’à %@
it: fino a %@
ja: %@まで
ko: 최대 %@
pt_br: até %@
ru: до %@
zh_hans: 最多 %@

source: user
de: Benutzer
es: usuario
fr: utilisateur
it: utente
ja: ユーザー
ko: 사용자
pt_br: usuário
ru: пользователь
zh_hans: 用户

source: viewer
de: Betrachter
es: observador
fr: spectateur
it: osservatore
ja: 閲覧者
ko: 뷰어
pt_br: visualizador
ru: зритель
zh_hans: 查看者

source: “%@” removed from the list
de: „%@“ aus der Liste entfernt
es: “%@” se eliminó de la lista
fr: « %@ » retiré de la liste
it: “%@” è stato rimosso dalla lista
ja: 「%@」をリストから削除しました
ko: ‘%@’을(를) 리스트에서 제거했어요
pt_br: “%@” foi removido da lista
ru: «%@» удалён из списка
zh_hans: 「%@」已从列表中移除

source: “%@” will lose access to the list. To restore it, a new invitation will be required.
de: „%@“ verliert den Zugriff auf die Liste. Für die Rückkehr ist eine neue Einladung erforderlich.
es: “%@” perderá el acceso a la lista. Para recuperarlo, hará falta una nueva invitación.
fr: « %@ » perdra l’accès à la liste. Pour le restaurer, une nouvelle invitation sera nécessaire.
it: “%@” perderà l’accesso alla lista. Per ripristinarlo serve un nuovo invito.
ja: 「%@」はリストへのアクセスを失います。戻すには新しい招待が必要です。
ko: ‘%@’은(는) 리스트에 대한 접근 권한을 잃어요. 복구하려면 새 초대가 필요해요.
pt_br: “%@” perderá o acesso à lista. Para restaurar, será preciso um novo convite.
ru: «%@» потеряет доступ к списку. Чтобы вернуть — потребуется новое приглашение.
zh_hans: 「%@」将失去对该列表的访问权限。如需恢复,需要发送新的邀请。

source: Dreams for tomorrow
de: Träume für morgen
es: Sueños para mañana
fr: Rêves pour demain
it: Sogni per domani
ja: 明日への夢
ko: 내일의 꿈
pt_br: Sonhos para amanhã
ru: Мечты на завтра
zh_hans: 明天的梦想

source: Inspiration list
de: Inspirationsliste
es: Lista de inspiración
fr: Liste d’inspiration
it: Lista di ispirazione
ja: インスピレーションリスト
ko: 영감 리스트
pt_br: Lista de inspiração
ru: Список вдохновения
zh_hans: 灵感清单

source: Want list
de: Will-haben-Liste
es: Lista de antojos
fr: Liste d’envies
it: Lista delle voglie
ja: ほしい物リスト
ko: 갖고 싶은 목록
pt_br: Lista de vontades
ru: Хотелки
zh_hans: 想要清单

source: Wish collection
de: Wunsch-Sammlung
es: Colección de deseos
fr: Collection de vœux
it: Collezione di desideri
ja: 願いコレクション
ko: 위시 컬렉션
pt_br: Coleção de desejos
ru: Коллекция желаний
zh_hans: 心愿合集

source: My finds
de: Meine Funde
es: Mis hallazgos
fr: Mes trouvailles
it: Le mie scoperte
ja: 見つけたもの
ko: 내가 찾은 것들
pt_br: Meus achados
ru: Мои находки
zh_hans: 我的发现

source: Idea list
de: Ideenliste
es: Lista de ideas
fr: Liste d’idées
it: Lista di idee
ja: アイデアリスト
ko: 아이디어 리스트
pt_br: Lista de ideias
ru: Список идей
zh_hans: 想法清单

source: Favorites
de: Favoriten
es: Favoritos
fr: Favoris
it: Preferiti
ja: お気に入り
ko: 즐겨찾기
pt_br: Favoritos
ru: Избранное
zh_hans: 收藏

source: Cherished dreams
de: Geliebte Träume
es: Sueños preciados
fr: Rêves précieux
it: Sogni nel cuore
ja: 大切な夢
ko: 소중한 꿈
pt_br: Sonhos queridos
ru: Заветные мечты
zh_hans: 珍藏的梦想

source: To remember
de: Zum Merken
es: Para recordar
fr: À retenir
it: Da ricordare
ja: 覚えておきたい
ko: 기억할 것
pt_br: Para lembrar
ru: На заметку
zh_hans: 记下来

source: Just want it
de: Will ich einfach
es: Simplemente lo quiero
fr: J’en ai juste envie
it: Lo voglio e basta
ja: ただ欲しい
ko: 그냥 갖고 싶음
pt_br: Só quero
ru: Просто хочу
zh_hans: 就是想要

source: Birthday
de: Geburtstag
es: Cumpleaños
fr: Anniversaire
it: Compleanno
ja: 誕生日
ko: 생일
pt_br: Aniversário
ru: День рождения
zh_hans: 生日

source: Books
de: Bücher
es: Libros
fr: Livres
it: Libri
ja: 本
ko: 책
pt_br: Livros
ru: Книги
zh_hans: 书籍

source: Travel
de: Reisen
es: Viajes
fr: Voyages
it: Viaggi
ja: 旅行
ko: 여행
pt_br: Viagens
ru: Путешествия
zh_hans: 旅行

source: Aesthetic
de: Ästhetik
es: Estética
fr: Esthétique
it: Estetica
ja: エステティック
ko: 미감
pt_br: Estética
ru: Эстетика
zh_hans: 美学

source: Waiting for network
de: Warte auf Netzwerk
es: Esperando red
fr: En attente du réseau
it: Attesa rete
ja: ネットワーク待ち
ko: 네트워크 대기 중
pt_br: Aguardando rede
ru: Ждёт сети
zh_hans: 等待网络

source: Keychain error: %d
de: Schlüsselbund-Fehler: %d
es: Error del llavero: %d
fr: Erreur trousseau : %d
it: Errore portachiavi: %d
ja: キーチェーンエラー: %d
ko: 키체인 오류: %d
pt_br: Erro do Keychain: %d
ru: Ошибка Keychain: %d
zh_hans: 钥匙串错误：%d

source: Cover
es: Portada
fr: Couverture
it: Copertina
ja: カバー
ko: 표지
pt_br: Capa
ru: Обложка
zh_hans: 封面

source: Feedback
es: Comentarios
fr: Commentaires
ja: フィードバック
ko: 피드백
ru: Обратная связь
zh_hans: 反馈

source: I Wish — feedback
es: I Wish — comentarios
fr: I Wish — commentaires
ja: I Wish — フィードバック
ko: I Wish — 피드백
ru: I Wish — обратная связь
zh_hans: I Wish — 反馈

source: Link
es: Enlace
fr: Lien
ja: リンク
ko: 링크
ru: Ссылка
zh_hans: 链接

source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Название
zh_hans: 名称

source: Optional
es: Opcional
fr: Facultatif
it: Facoltativo
ja: 任意
ko: 선택 사항
pt_br: Opcional
ru: Опционально
zh_hans: 可选

source: Version %@
es: Versión %@
it: Versione %@
ja: バージョン %@
ko: 버전 %@
pt_br: Versão %@
ru: Версия %@
zh_hans: 版本 %@

source: ——— Version: %@ (%@) iOS: %@
es: ——— Versión: %@ (%@) iOS: %@
it: ——— Versione: %@ (%@) iOS: %@
ja: ——— バージョン: %@ (%@) iOS: %@
ko: ——— 버전: %@ (%@) iOS: %@
pt_br: ——— Versão: %@ (%@) iOS: %@
ru: ——— Версия: %@ (%@) iOS: %@
zh_hans: ——— 版本:%@ (%@) iOS:%@

source: link
es: enlace
fr: lien
ja: リンク
ko: 링크
ru: ссылка
zh_hans: 链接

source: Bucket list
es: Lista de pendientes
ja: バケットリスト
ko: 버킷리스트
zh_hans: 人生清单

source: Emoji
fr: Émoji
ja: 絵文字
ko: 이모지
ru: Эмодзи
zh_hans: 表情

source: Gadgets
it: Gadget
ja: ガジェット
ko: 가젯
ru: Гаджеты
zh_hans: 数码好物

source: 15 min
ja: 15分
ko: 15분
ru: 15 мин
zh_hans: 15 分钟
